swat-dp-tools/soma/xml/device-import.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Header />
    <soapenv:Body>
        <dp:request domain="default">
            <dp:do-import source-type="@soma.content.type@" dry-run="false" overwrite-files="true" overwrite-objects="true" deployment-policy="@deployment.policy@">
                <dp:input-file>@soma.content@</dp:input-file>
            </dp:do-import>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>